iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_mci_driver.c
/***********************************************************************
 * $Id: lpc23xx_mci_driver.c 28 2014-01-27 14:45:13Z danielru $
 *
 * Project: LPC23xx MCI driver
 *
 * Description:
 *     This file contains driver support for the LPC23xx MCI.
 *
 ***********************************************************************
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * products. This software is supplied "AS IS" without any warranties.
 * NXP Semiconductors assumes no responsibility or liability for the
 * use of the software, conveys no license or title under any patent,
 * copyright, or mask work right to the product. NXP Semiconductors
 * reserves the right to make changes in the software without
 * notification. NXP Semiconductors also make no representation or
 * warranty that such application will be suitable for the specified
 * use without further testing or modification.
 *********************************************************************/
#include "lpc23xx_mci_driver.h"
#include "lpc23xx_scb_driver.h"
#include "lpc23xx_vic_driver.h"
#include "lpc23xx_pinsel_driver.h"
#include "lpc23xx_dma_driver.h"
#include <string.h>

/* MCI device configuration structure type */
typedef struct {
	BOOL32 init;
	MCI_Type *regptr;
	__IO U8* WriteDataBuffer;  /* Used in Interrupt Mode */
	__IO U8* ReadDataBuffer;   /* Used in Interrupt Mode */
} MCI_DRVDAT_T;

__IO U32 MCI_DataErrorProcess_count; /* Data error process count */
__IO U32 MCI_DATA_END_InterruptService_count; /* Data end interrupt service count */
__IO U32 MCI_FIFOInterruptService_count; /* FIFO interrupt service count */
__IO U32 MCI_CmdProcess_count; /* Command process count */

__IO U32 CmdCRCErrCount; /* Command CRC error count */
__IO U32 CmdTimeoutErrCount; /* Command Timeout error count */
__IO U32 CmdRespEndCount; /* Command response end count */
__IO U32 CmdSentCount; /* Command send count */
__IO U32 CmdActiveCount; /* Command active count */

__IO U32 DataCRCErrCount; /* Data CRC error count */
__IO U32 DataTimeoutErrCount; /* Data Timeout error count */
__IO U32 DataTxUnderrunErrCount; /* Data transmit underrun error count */
__IO U32 DataRxOverrunErrCount; /* Data receive overrun error count */
__IO U32 DataStartbitErrCount; /* Data start bit error count */

__IO U32 DataEndCount; /* Data end count */
__IO U32 DataBlockEndCount; /* Data block end count */
__IO U32 MCI_Block_End_Flag; /* Block End Flag */

__IO U32 DataTxActiveCount; /* Data transmit active count */
__IO U32 DataRxActiveCount; /* Data receive active count */

__IO U32 DataFIFOCount; /* Data FIFO count */
__IO U32 DataRxFIFOCount; /* Data Receive FIFO count */
__IO U32 DataTxFIFOCount; /* Data Transmit FIFO count */

__IO U32 MCI_CardType; /* Card type */
__IO U32 CardRCA; /* Card RCA (Relative Card Address)*/

__IO U32 SDStatRead = 0; /* SD read status */

__IO S8 *WriteBlock = (S8 *) (MCI_DMA_SRC); /* treat WriteBlock as a constant address */
__IO S8 *ReadBlock = (S8 *) (MCI_DMA_DST); /* treat ReadBlock as a constant address */

__IO U32 TXBlockCounter = 0, RXBlockCounter = 0; /* TX/RX block count*/

U32 MCI_SendStatus(void);
U32 MCI_SendACMDBusWidth(U32 busWidth);

/* MCI device configuration structure data */
STATIC MCI_DRVDAT_T mcidrvdat;


/**********************************************************************
 * Function: 	MCI_ReadFIFO
 *
 * Purpose: 	Read MCI_FIFO to data buffer.
 * 				This function is used in Interrupt Mode
 *
 * Parameter:
 * 			dst: data buffer
 *
 * Return: 		None
 *
 *********************************************************************/
void MCI_ReadFIFO(U32 *dst) {
	__IO U32 i;

	for (i = 0; i < 8; i++) {
		*dst = MCI_FIFO;
		dst++;
	}
	return;
}

/**********************************************************************
 * Function: 	MCI_WriteFIFO
 *
 * Purpose: 	Write data from data buffer to MCI FIFO.
 * 				This function is used in Interrupt Mode
 *
 * Parameter:
 * 			src: data buffer
 *
 * Return: 		None
 *
 *********************************************************************/
void MCI_WriteFIFO(U32 *src) {
	__IO U32 i;

	for (i = 0; i < 8; i++) {
		MCI_FIFO = *src;
		src++;
	}
	return;
}

/**********************************************************************
 * Function: MCI_BusMode
 *
 * Purpose: Set MCI bus mode (Open drain or not)
 *
 * Parameter:
 * 		bus_mode: bus mode
 *
 * Return: None
 *
 *********************************************************************/
void MCI_BusMode(U32 bus_mode) {
	__IO U32 i;

	if (bus_mode == OPEN_DRAIN) {
		mcidrvdat.regptr->POWER |= MCI_POWER_OPENDRAIN;
	} else {
		mcidrvdat.regptr->POWER &= ~MCI_POWER_OPENDRAIN;
	}

	/* Delay after switching mode */
	for (i = 0; i < 1000; i++)
		;
	return;
}

/**********************************************************************
 * Function: 	MCI_TXEnable
 *
 * Purpose: 	Enable MCI data transmit
 *
 * Parameter: 	None
 *
 * Return: 		None
 *
 *********************************************************************/
void MCI_TXEnable(void) {

#if MCI_DMA_ENABLED
	mcidrvdat.regptr->MASK0 |= ((DATA_END_INT_MASK) | (ERR_TX_INT_MASK)); /* Enable TX interrupts only */
	mcidrvdat.regptr->MASK1 |= ((DATA_END_INT_MASK) | (ERR_TX_INT_MASK)); /* Enable TX interrupts only */
#else
	mcidrvdat.regptr->MASK0 |= ((FIFO_TX_INT_MASK) | (DATA_END_INT_MASK)
			| (ERR_TX_INT_MASK)); /* FIFO TX interrupts only */
	mcidrvdat.regptr->MASK1 |= ((FIFO_TX_INT_MASK) | (DATA_END_INT_MASK)
			| (ERR_TX_INT_MASK)); /* FIFO TX interrupts only */
#endif
	return;
}

/**********************************************************************
 * Function: 	MCI_TXDisable
 *
 * Purpose: 	Disable MCI data transmit
 *
 * Parameter: 	None
 *
 * Return: 		None
 *
 *********************************************************************/
void MCI_TXDisable(void) {

#if MCI_DMA_ENABLED
	mcidrvdat.regptr->MASK0 &= ~((DATA_END_INT_MASK) | (ERR_TX_INT_MASK)); /* Enable TX interrupts only */
	mcidrvdat.regptr->MASK1 &= ~((DATA_END_INT_MASK) | (ERR_TX_INT_MASK)); /* Enable TX interrupts only */
#else
	mcidrvdat.regptr->MASK0 &= ~((FIFO_TX_INT_MASK) | (DATA_END_INT_MASK)
			| (ERR_TX_INT_MASK)); /* FIFO TX interrupts only */
	mcidrvdat.regptr->MASK1 &= ~((FIFO_TX_INT_MASK) | (DATA_END_INT_MASK)
			| (ERR_TX_INT_MASK)); /* FIFO TX interrupts only */
#endif
	return;
}

/**********************************************************************
 * Function: 	MCI_RXEnable
 *
 * Purpose: 	Enable MCI data receive
 *
 * Parameter: 	None
 *
 * Return: 		None
 *
 *********************************************************************/
void MCI_RXEnable(void) {

#if MCI_DMA_ENABLED
	mcidrvdat.regptr->MASK0 |= ((DATA_END_INT_MASK) | (ERR_RX_INT_MASK)); /* Enable RX interrupts only */
	mcidrvdat.regptr->MASK1 |= ((DATA_END_INT_MASK) | (ERR_RX_INT_MASK)); /* Enable RX interrupts only */
#else
	mcidrvdat.regptr->MASK0 |= ((FIFO_RX_INT_MASK) | (DATA_END_INT_MASK)
			| (ERR_RX_INT_MASK)); /* FIFO RX interrupts only */
	mcidrvdat.regptr->MASK1 |= ((FIFO_RX_INT_MASK) | (DATA_END_INT_MASK)
			| (ERR_RX_INT_MASK)); /* FIFO RX interrupts only */
#endif
	return;
}

/**********************************************************************
 * Function: 	MCI_RXDisable
 *
 * Purpose: 	Disable MCI data receive
 *
 * Parameter: 	None
 *
 * Return: 		None
 *
 *********************************************************************/
void MCI_RXDisable(void) {

#if MCI_DMA_ENABLED
	mcidrvdat.regptr->MASK0 &= ~((DATA_END_INT_MASK) | (ERR_RX_INT_MASK)); /* Enable TX interrupts only */
	mcidrvdat.regptr->MASK1 &= ~((DATA_END_INT_MASK) | (ERR_RX_INT_MASK)); /* Enable TX interrupts only */
#else
	mcidrvdat.regptr->MASK0 &= ~((FIFO_RX_INT_MASK) | (DATA_END_INT_MASK)
			| (ERR_RX_INT_MASK)); /* FIFO TX interrupts only */
	mcidrvdat.regptr->MASK1 &= ~((FIFO_RX_INT_MASK) | (DATA_END_INT_MASK)
			| (ERR_RX_INT_MASK)); /* FIFO TX interrupts only */
#endif
	return;
}

