iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_mci_driver.c
/******************************************************************************
* Function:		MCI_CheckStatus
*
* Purpose:		MCI Check status before and after the block read and
*						write. Right after the block read and write, this routine
*						is important that, even the FIFO is empty, complete
*						block has been sent, but, data is still being written
*						to the card, this routine is to ensure that the data
*						has been written based on the state of the card, not
*						by the length being set.
*
* Parameter:	None
*
* Return:		TRUE or FALSE
*
*****************************************************************************/
U32 MCI_CheckStatus(void) {
	U32 respValue;

	while (1) {
		if ((respValue = MCI_SendStatus()) == INVALID_RESPONSE) {
			break;
		} else {
			/* The only valid state is TRANS per MMC and SD state diagram.
			 RCV state may be seen, but, I have found that it happens
			 only when TX_ACTIVE or RX_ACTIVE occurs before the WRITE_BLOCK and
			 READ_BLOCK cmds are being sent, which is not a valid sequence. */
			if ((respValue & (0x0F << 8)) == 0x0900) {
				return (TRUE);
			}
		}
	}
	return (FALSE);
}

/******************************************************************************
* Function:		MCI_CmdHandler
*
* Purpose:		Called by MCI_ISR
*				To simplify the process, for card initialization, the
*					CMD interrupts are disabled.
*
* Parameter:	None
*
* Return:		None
*
******************************************************************************/
void MCI_CmdHandler(void) {
	U32 mci_status;

	mci_status = mcidrvdat.regptr->STATUS;
	if (mci_status & MCI_CMDCRCFAIL) {
		CmdCRCErrCount++;
		mcidrvdat.regptr->CLEAR = MCI_CMDCRCFAIL;
	}
	if (mci_status & MCI_CMDTIMEOUT) {
		CmdTimeoutErrCount++;
		mcidrvdat.regptr->CLEAR = MCI_CMDTIMEOUT;
	}
	/* Cmd Resp End or Cmd Sent */
	if (mci_status & MCI_CMDRESPEND) {
		CmdRespEndCount++;
		mcidrvdat.regptr->CLEAR = MCI_CMDRESPEND;
	}
	if (mci_status & MCI_CMDSENT) {
		CmdSentCount++;
		mcidrvdat.regptr->CLEAR = MCI_CMDSENT;
	}
	if (mci_status & MCI_CMDACTIVE) {
		CmdActiveCount++;
		mcidrvdat.regptr->CLEAR = MCI_CMDACTIVE;
	}
	return;
}

/******************************************************************************
* Function:		MCI_DataErrorHandler
*
* Purpose:		Called by MCI_ISR
*					Process data error.
*
* Parameter:	None
*
* Return:		None
*
******************************************************************************/
void MCI_DataErrorHandler(void) {
	U32 MCIStatus;

	MCIStatus = mcidrvdat.regptr->STATUS;
	if (MCIStatus & MCI_DATACRCFAIL) {
		DataCRCErrCount++;
		mcidrvdat.regptr->CLEAR = MCI_DATACRCFAIL;
	}
	if (MCIStatus & MCI_DATATIMEOUT) {
		DataTimeoutErrCount++;
		mcidrvdat.regptr->CLEAR = MCI_DATATIMEOUT;
	}
	/* Underrun or overrun */
	if (MCIStatus & MCI_TXUNDERRUN) {
		DataTxUnderrunErrCount++;
		mcidrvdat.regptr->CLEAR = MCI_TXUNDERRUN;
	}
	if (MCIStatus & MCI_RXOVERRUN) {
		DataRxOverrunErrCount++;
		mcidrvdat.regptr->CLEAR = MCI_RXOVERRUN;
	}
	/* Start bit error on data signal */
	if (MCIStatus & MCI_STARTBITERR) {
		DataStartbitErrCount++;
		mcidrvdat.regptr->CLEAR = MCI_STARTBITERR;
	}
	return;
}

/******************************************************************************
* Function:		MCI_DataEndHandler
*
* Purpose:		Called by MCI_ISR
*				This is the last interrupt module processing
*                   the block write and read to and from the MMC/SD card.
*
*               FIFO interrupts are also used when DMA is disabled
*				This routine simply clears the
*                   MCI_Block_End_Flag, and increments counters for debug
*
* Parameter:	None
*
* Returne:		None
*
******************************************************************************/
void MCI_DataEndHandler(void) {
	U32 mci_status;

	mci_status = mcidrvdat.regptr->STATUS;
	if (mci_status & MCI_DATAEND) /* Data end, and Data block end  */
	{
		DataEndCount++;
		mcidrvdat.regptr->CLEAR = MCI_DATAEND;
		return;
	}
	if (mci_status & MCI_DATABLOCKEND) {
		DataBlockEndCount++;
#if !MCI_DMA_ENABLED
		MCI_SendStop();
#endif
		mcidrvdat.regptr->CLEAR = MCI_DATABLOCKEND;
		MCI_RXDisable();
		MCI_Block_End_Flag = 0;
		return;
	}

	/* Tx active  */
	if (mci_status & MCI_TXACTIVE) {
		DataTxActiveCount++;
	}
	/* Rx active  */
	if (mci_status & MCI_RXACTIVE) {
		DataRxActiveCount++;
	}
	return;
}

/******************************************************************************
* Function:		MCI_FIFOHandler
*
* Purpose:		Called by MCI_ISR when using FIFO
*					interrupts and DMA is disabled
*
* Parameter:	None
*
* Return:		None
*
******************************************************************************/
void MCI_FIFOHandler(void) {
#if !MCI_DMA_ENABLED
	U32 MCIStatus;

	MCIStatus = mcidrvdat.regptr->STATUS;
	if (MCIStatus & (FIFO_TX_INT_MASK)) {
		DataTxFIFOCount++; /* if using TX_HALF_EMPTY remove one WriteFifo below */
		if (MCIStatus & MCI_TXFIFOHALFEMPTY) /* empty is multiple of 512 block size */
		{
			MCI_WriteFIFO((U32 *) &mcidrvdat.WriteDataBuffer[TXBlockCounter]); /* write 8 words to fifo */
			TXBlockCounter += 32;
		}
		if (TXBlockCounter == BLOCK_LENGTH) /* block complete */
		{
			TXBlockCounter = 0;
			mcidrvdat.regptr->MASK0 &= ~(FIFO_TX_INT_MASK); /* disable FIFO int until next block write */
			mcidrvdat.regptr->MASK1 &= ~(FIFO_TX_INT_MASK);
			/* wait for SD card to complete sending data i.e MCI_DATA_BLK_END interrupt */
		}
	} else if (MCIStatus & (FIFO_RX_INT_MASK)) {
		DataRxFIFOCount++;
		if (MCIStatus & MCI_RXFIFOHALFFULL) /* if using RX_HALF_FULL remove one ReadFIFO below */
		{
			MCI_ReadFIFO((U32 *) &mcidrvdat.ReadDataBuffer[RXBlockCounter]); /* read 8 words from fifo */
			RXBlockCounter += 32;
		}
		if (RXBlockCounter == BLOCK_LENGTH) /* block complete */
		{
			RXBlockCounter = 0;
		}
	}
#endif
	DataFIFOCount++;
	return;
}

/******************************************************************************
* Function:		MCI_ISR
*
* Purpose:		MCI interrupt handler
*				The handler to handle the block data write and read
*					not for the commands.
*
* Parameter:	None
*
* Returne:		None
*
******************************************************************************/
void MCI_ISR(void) {
	U32 MCI_Status;

	MCI_Status = mcidrvdat.regptr->STATUS;
	/* handle MCI_STATUS interrupt */
	if (MCI_Status & DATA_ERR_INT_MASK) {
		MCI_DataErrorHandler();
		MCI_DataErrorProcess_count++;
		VIC_Ack(); /* Acknowledge Interrupt */
		return;
	}
	if (MCI_Status & DATA_END_INT_MASK) {
		MCI_DataEndHandler();
		MCI_DATA_END_InterruptService_count++;
		VIC_Ack(); /* Acknowledge Interrupt */
		return;
	} else if (MCI_Status & FIFO_INT_MASK) {
		MCI_FIFOHandler();
		MCI_FIFOInterruptService_count++;
		VIC_Ack(); /* Acknowledge Interrupt */
		return;
	} else if (MCI_Status & CMD_INT_MASK) {
		MCI_CmdHandler();
		MCI_CmdProcess_count++;
		VIC_Ack(); /* Acknowledge Interrupt */
		return;
	}
	VIC_Ack(); /* Acknowledge Interrupt */
}

