iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_mci_driver.c
/******************************************************************************
* Function:		MCI_SetClockRate
*
* Purpose:		Set MCI clock rate, during initialization phase < 400K
*						during data phase < 20Mhz.
*
* Parameter:
* 			clockrate: Clock rate value to be set
*
* Return:		None
*
*****************************************************************************/
void MCI_SetClockRate(U32 clockrate) {

	U32 i, ClkValue = 0;

	if (clockrate == MCI_SLOW_RATE)
		ClkValue |= MCI_CLKDIV_SLOW;
	else if (clockrate == MCI_NORMAL_RATE)
		ClkValue |= MCI_CLKDIV_NORMAL;

	mcidrvdat.regptr->CLOCK &= 0; // Clear Clock Register
	mcidrvdat.regptr->CLOCK |= MCI_CLOCK_CLKDIV(ClkValue); // Set Clock rate
	mcidrvdat.regptr->CLOCK |= MCI_CLOCK_ENABLE; // Enable Clock

	for (i = 0; i < 0x100; i++)
		; /* delay 3MCLK + 2PCLK before next write */

	return;
}

/******************************************************************************
* Function:		MCI_SetBusWidth
*
* Purpose:		Set data bus width: 1-bit bus or 4-bit bus.
*
* Parameter:
* 			width:	bus width
*
* Return:		TRUE or FALSE
*
*****************************************************************************/
U32 MCI_SetBusWidth(U32 width) {
	__IO U32 i;

	for (i = 0; i < 0x10; i++)
		; /* delay 3MCLK + 2PCLK  */

	if (width == BUS_WIDTH_1BIT) {
		mcidrvdat.regptr->CLOCK &= ~MCI_CLOCK_WIDEBUS;
	}
	if (width == BUS_WIDTH_4BITS) {
		mcidrvdat.regptr->CLOCK |= MCI_CLOCK_WIDEBUS;
	}
	if (MCI_SendACMDBusWidth(BUS_WIDTH_4BITS) == FALSE) {
		return (FALSE);
	}

	return TRUE;
}

/******************************************************************************
* Function:		MCI_Start
*
* Purpose:		Set MCI clock and power registers, setup VIC for
*					data interrupt.
*
* Parameter:	None
*
* Return:		TRUE or FALSE
* 				if VIC table is full, return FALSE
*
*****************************************************************************/
S32 MCI_Start() {
	__IO U32 i;

	mcidrvdat.regptr = (MCI_Type *) MMC_SD;

	SCB_EnablePPWR(PCSDC); /* Enable clock to the MCI block */

	if ( mcidrvdat.regptr->CLOCK & (1 << 8)) {
		mcidrvdat.regptr->CLOCK &= ~(1 << 8);
	}
	if ( mcidrvdat.regptr->POWER & 0x02) {
		mcidrvdat.regptr->POWER = 0;
	}
	for (i = 0; i < 0x10000; i++)
		;

	/* Disable all interrupts for now */
	mcidrvdat.regptr->MASK0 = 0;
	mcidrvdat.regptr->MASK1 = 0;

	/* Set MICPWR pin is high */
	SCB_SetMCIPWR(TRUE);
	/* Set MCI Clock Divide = 1
	 * If CCLK = 48Mhz, MCI_CLOCK = 48Mhz*/
	SCB_SetPCLKDiv(PCLK_MCI, CCLK_DIV_1);

	/* Configure pin I/O for MCI */
	PINSEL_Set(PORT_0, 19, FUNC_2); // MCICLK pin
	PINSEL_Set(PORT_0, 20, FUNC_2); // MCICMD pin
	PINSEL_Set(PORT_0, 21, FUNC_2); // MCIPWR pin

	PINSEL_Set(PORT_0, 22, FUNC_2); // MCIDAT0 pin
	PINSEL_Set(PORT_2, 11, FUNC_2); // MCIDAT1 pin
	PINSEL_Set(PORT_2, 12, FUNC_2); // MCIDAT2 pin
	PINSEL_Set(PORT_2, 13, FUNC_2); // MCIDAT3 pin


	/*set up clocking default mode, clear any registers as needed */
	mcidrvdat.regptr->COMMAND = 0;
	mcidrvdat.regptr->DATACTRL = 0;
	mcidrvdat.regptr->CLEAR = 0x7FF;

	mcidrvdat.regptr->POWER = MCI_POWER_UP;

	while (!(mcidrvdat.regptr->POWER & MCI_POWER_UP))
		;

	for (i = 0; i < 5000; i++)
		;

	/* During identification phase, the clock should be less than
	 400Khz. Once we pass this phase, the normal clock can be set up
	 to 25Mhz on SD card and 20Mhz on MMC card. */
	MCI_SetClockRate(MCI_SLOW_RATE);
	mcidrvdat.regptr->POWER |= 0x01;

	for (i = 0; i < 50000; i++)
		;

	/* Install MCI interrupt handler */
	if (VIC_InstallIRQ(SD_MMC_INT, (void *) MCI_ISR, 2) == _ERROR) {
		return (_ERROR);
	}
	/* Enable MCI interrupt */
	VIC_EnableInt(SD_MMC_INT);
	/* During the initialization phase, to simplify the process, the CMD related
	 interrupts are disabled. The DATA related interrupts are enabled when
	 the FIFOs are used and just before WRITE_BLOCK READ_BLOCK cmds are issues, and
	 disabled after the data block has been written and read. Please also note,
	 before WRITE_BLOCK only TX related data interrupts are enabled, and before
	 READ_BLOCK only RX related data interrupts are enabled. */
	mcidrvdat.init = TRUE;
	return (TRUE);

}

/******************************************************************************
* Function:		MCI_SendCommand
*
* Purpose:		The routine is used to send a CMD to the card
* 					and get Command Response from card
*
* Parameter:
* 			cmd : Command Index in MCI_CMD enum
* 			arg : Command Argument
* 			expect_reponse : Command Response Type.
* 							 expect response flag could be  EXPECT_NO_RESP
* 															EXPECT_SHORT_RESP
* 															EXPECT_LONG_RESP
* 			allow_timeout :	Command Timeout
* 			cmd_resp : Command Response Data
*
* Return:		INVALID_RESPONSE : invalid response
* 				0				 : valid response
*
*****************************************************************************/
S32 MCI_SendCommand(U32 cmd, U32 arg, U32 expect_response, U32 allow_timeout, U32* cmd_resp){

	U32 CmdData = 0;
	U32 CmdStatus;
	U32 LastCmdIndex;

	CmdStatus = mcidrvdat.regptr->STATUS;

	/*set the command details, the CmdIndex should 0 through 0x3F only */
	CmdData |= MCI_COMMAND_CMDINDEX(cmd);

	switch (expect_response) {
	case EXPECT_SHORT_RESP:
		CmdData |= MCI_COMMAND_RESPONSE;
		break;
	case EXPECT_LONG_RESP:
		CmdData |= MCI_COMMAND_RESPONSE | MCI_COMMAND_LONGRSP;
		break;
	}

	if (allow_timeout) /* allow timeout or not */
		CmdData |= MCI_COMMAND_INTERRUPT;
	else
		CmdData &= ~MCI_COMMAND_INTERRUPT;

	/*send the command*/
	CmdData |= MCI_COMMAND_ENABLE;
	mcidrvdat.regptr->ARGUMENT = arg;
	mcidrvdat.regptr->COMMAND = CmdData;

	if (expect_response == EXPECT_NO_RESP) {
		while ((CmdStatus = mcidrvdat.regptr->STATUS) & MCI_CMDACTIVE) {
			mcidrvdat.regptr->CLEAR = 0x7FF;
		}
		return 0;
	}

	while (1) {
		CmdStatus = mcidrvdat.regptr->STATUS;
		if (CmdStatus & MCI_CMDTIMEOUT) {
			mcidrvdat.regptr->CLEAR = CmdStatus | MCI_CMDTIMEOUT;
			mcidrvdat.regptr->COMMAND = 0;
			mcidrvdat.regptr->ARGUMENT = 0xFFFFFFFF;
			return (CmdStatus);
		}
		if (CmdStatus & MCI_CMDCRCFAIL) {
			mcidrvdat.regptr->CLEAR = CmdStatus | MCI_CMDCRCFAIL;
			LastCmdIndex = mcidrvdat.regptr->COMMAND & 0x003F;
			/* ignore CRC error if it's a response for SEND_OP_COND or STOP_TRANSMISSION */
			if ((LastCmdIndex == SEND_OP_COND) || (LastCmdIndex
					== SEND_APP_OP_COND) || (LastCmdIndex == STOP_TRANSMISSION)) {
				mcidrvdat.regptr->COMMAND = 0;
				mcidrvdat.regptr->ARGUMENT = 0xFFFFFFFF;
				break;
			} else {
				return (CmdStatus);
			}
		}
		if (CmdStatus & MCI_CMDRESPEND) {
			mcidrvdat.regptr->CLEAR = CmdStatus | MCI_CMDRESPEND;
			break; /* cmd response is received, expecting response */
		}
	}

	if (MCI_RESPCMD_CMDINDEX(mcidrvdat.regptr->RESPCMD) != cmd) {
		/* If the response is not R1, in the response field, the Expected Cmd data
		 won't be the same as the CMD data in SendCmd(). Below four cmds have
		 R2 or R3 response. We don't need to check if MCI_RESP_CMD is the same
		 as the Expected or not. */
		if ((cmd != SEND_OP_COND) && (cmd
				!= SEND_APP_OP_COND) && (cmd != ALL_SEND_CID)
				&& (cmd != SEND_CSD)) {
			CmdStatus = INVALID_RESPONSE;
			return (INVALID_RESPONSE);
		}
	}

