iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_mci_driver.c
	if (expect_response == EXPECT_SHORT_RESP) {
		*cmd_resp = mcidrvdat.regptr->RESPONSE0;
	} else if (expect_response == EXPECT_LONG_RESP) {
		*cmd_resp = mcidrvdat.regptr->RESPONSE0;
		*(cmd_resp + 1) = mcidrvdat.regptr->RESPONSE1;
		*(cmd_resp + 2) = mcidrvdat.regptr->RESPONSE2;
		*(cmd_resp + 3) = mcidrvdat.regptr->RESPONSE3;
	}

	return (0); /* Read MCI_RESP0 register assuming it's not long response. */
}

/******************************************************************************
* Function:		MCI_GoIdleState
*
* Purpose:		CMD0, the very first command to be sent to initialize
*						either MMC or SD card.
*
* Parameter:	None
*
* Return:		TRUE or FALSE, TRUE if card has been initialized.
*
*****************************************************************************/
U32 MCI_GoIdleState(void) {
	U32 retryCount;
	U32 respStatus;
	U32 respValue[4];

	retryCount = 50;
	while (retryCount > 0) {
		/* Send CMD0 command repeatedly until the response is back correctly */
		respStatus = MCI_SendCommand(GO_IDLE_STATE, 0,
									EXPECT_NO_RESP, 0, (U32 *) respValue);
		if (respStatus == 0) {
			break;
		}
		retryCount--;
	}

	if (respStatus != 0) /* timeout, give up */
	{
		return (FALSE);
	}

	return (TRUE);
}

/******************************************************************************
* Function:		MCI_SendOpCond
*
* Purpose:		CMD1 for MMC
*
* Parameter:	None
*
* Return:		TRUE or FALSE, TRUE if card has response back before
*					timeout, FALSE is timeout on the command.
*
*****************************************************************************/
U32 MCI_SendOpCond(void) {
	U32 i, retryCount;
	U32 respStatus;
	U32 respValue[4];

	retryCount = 200; /* reset retry counter */
	while (retryCount > 0) {
		/* Send CMD1 command repeatedly until the response is back correctly */
		respStatus = MCI_SendCommand(SEND_OP_COND, OCR_INDEX,
									EXPECT_SHORT_RESP, 0, (U32 *) &respValue[0]);
		/* bit 0 and bit 2 must be zero, or it's timeout or CRC error */
		if (!(respStatus & MCI_CMDTIMEOUT) && (respValue[0] & 0x80000000)) {
			return (TRUE); /* response is back and correct. */
		}
		for (i = 0; i < 50; i++)
			;
		retryCount--;
	}

	return (FALSE);
}

/******************************************************************************
* Function:		MCI_SendACMD
*
* Purpose:		CMD55, before sending an ACMD, call this routine first
*
* Parameter:	None
*
* Return:		TRUE or FALSE, TRUE if card has responded before timeout.
*					FALSE is timeout.
*
*****************************************************************************/
U32 MCI_SendACMD(void) {
	U32 i, retryCount;
	U32 CmdArgument;
	U32 respStatus;
	U32 respValue[4];

	if (MCI_CardType == SD_CARD) {
		CmdArgument = CardRCA; /* Use the address from SET_RELATIVE_ADDR cmd */
	} else /* if MMC or unknown card type, use 0x0. */
	{
		CmdArgument = 0x00000000;
	}

	retryCount = 20;
	while (retryCount > 0) {
		/* Send CMD55 command followed by an ACMD */
		respStatus = MCI_SendCommand(APP_CMD, CmdArgument,
									EXPECT_SHORT_RESP, 0, (U32 *) &respValue[0]);
		if (!respStatus && (respValue[0] & CARD_STATUS_ACMD_ENABLE)) /* Check if APP_CMD enabled */
		{
			return (TRUE);
		}
		for (i = 0; i < 50; i++)
			;
		retryCount--;
	}
	return (FALSE);
}

/******************************************************************************
* Function:		MCI_SendACMDOpCond
*
* Purpose:		If SEND_OP_COND is timeout, it's not a MMC card, try
*					this combination to see if we can communicate with
*					a SD card.
*
* Parameter:	None
*
* Return:		TRUE or FALSE, TRUE if card has been initialized.
*
*****************************************************************************/
U32 MCI_SendACMDOpCond(void) {
	U32 i, retryCount;
	U32 respStatus;
	U32 respValue[4];

	/* timeout on SEND_OP_COND command on MMC, now, try SEND_APP_OP_COND
	 command to SD */
	retryCount = 100; /* reset retry counter */
	while (retryCount > 0) {
		mcidrvdat.regptr->POWER &= ~MCI_POWER_OPENDRAIN; /* Clear Open Drain output control for SD */
		for (i = 0; i < 3000; i++)
			;
		if (MCI_SendACMD() == FALSE) {
			retryCount--;
			continue;
		}
		/* Send ACMD41 command repeatedly until the response is back correctly */
		respStatus = MCI_SendCommand(SEND_APP_OP_COND, OCR_INDEX,
									EXPECT_SHORT_RESP, 0, (U32 *) &respValue[0]);
		if (!(respStatus & MCI_CMDTIMEOUT) && (respValue[0] & 0x80000000)) {
			return (TRUE); /* response is back and correct. */
		}
		for (i = 0; i < 50; i++)
			;
		retryCount--;
	}

	return (FALSE);
}

/******************************************************************************
* Function:		MCI_CardInit
*
* Purpose:		Try CMD1 first for MMC, if it's timeout, try CMD55
*					and CMD41 for SD, if both failed, initialization failure,
*					bailout with unknown card type. Otherwise, return the
*					card type, either MMC or SD.
*
* Parameter:	None
*
* Return:		Card type.
*
*****************************************************************************/
U32 MCI_CardInit(void) {
	U32 i;

	/* Reset card using CMD0 */
	if (MCI_GoIdleState() == FALSE) {
		return (CARD_UNKNOWN);
	}

	MCI_BusMode(OPEN_DRAIN);

	for ( i = 0; i < 0x3000; i++ );

	/* Try CMD1 first for MMC, if it's timeout, try CMD55 and CMD41 for SD,
	 if both failed, initialization failure, timeout */
	if (MCI_SendOpCond() == TRUE) {
		MCI_CardType = MMC_CARD;
		return (MCI_CardType); /* Found the card, it's a MMC */
	}
	if (MCI_SendACMDOpCond() == TRUE) {
		MCI_CardType = SD_CARD;
		return (MCI_CardType); /* Found the card, it's a SD */
	}

	/* tried both MMC and SD card, give up */
	return (CARD_UNKNOWN);
}

/******************************************************************************
* Function:		MCI_CheckCID
*
* Purpose:		Send CMD2, ALL_SEND_CID
*
* Parameter:	None
*
* Return:		If not timeout, return TRUE.
*
*****************************************************************************/
U32 MCI_CheckCID(void) {
	U32 i, retryCount;
	U32 respStatus;
	U32 respValue[4];

	/* This command is normally after CMD1(MMC) or ACMD41(SD). */
	retryCount = 50; /* reset retry counter */
	while (retryCount > 0) {
		/* Send CMD2 command repeatedly until the response is back correctly */
		respStatus = MCI_SendCommand(ALL_SEND_CID, 0,
									EXPECT_LONG_RESP, 0, (U32 *) &respValue[0]);
		/* bit 0 and bit 2 must be zero, or it's timeout or CRC error */
		if (!(respStatus & MCI_CMDTIMEOUT)) {
			return (TRUE); /* response is back and correct. */
		}
		for (i = 0; i < 50; i++)
			;
		retryCount--;
	}
	return (FALSE);
}

