iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_mci_driver.c
/******************************************************************************
* Function:		MCI_SetAddress
*
* Purpose:		Send CMD3, SET_RELATIVE_ADDR, should after CMD2
*
* Parameter:	None
*
* Return:		TRUE if response is back before timeout.
*
*****************************************************************************/
U32 MCI_SetAddress(void) {
	U32 i, retryCount;
	U32 respStatus;
	U32 respValue[4];
	U32 CmdArgument;

	/* If it's a SD card, SET_RELATIVE_ADDR is to get the address
	 from the card and use this value in RCA, if it's a MMC, set default
	 RCA address. 0x00010000. */
	if (MCI_CardType == MMC_CARD) {
		CmdArgument = 0x00010000;
	} else /* If it's unknown or MMC_CARD, fix the RCA address */
	{
		CmdArgument = 0;
	}

	retryCount = 50; /* reset retry counter */
	while (retryCount > 0) {
		/* Send CMD3 command repeatedly until the response is back correctly */
		respStatus = MCI_SendCommand(SET_RELATIVE_ADDR, CmdArgument,
									EXPECT_SHORT_RESP, 0, (U32 *) &respValue[0]);
		/* bit 0 and bit 2 must be zero, or it's timeout or CRC error */
		/* It should go to IDEN state and bit 8 should be 1 */
		if (!(respStatus & MCI_CMDTIMEOUT) && ((respValue[0] & (0x0F << 8))
				== 0x0500)) {
			CardRCA = respValue[0] & 0xFFFF0000; /* Save the RCA value from SD card */
			return (TRUE); /* response is back and correct. */
		}
		for (i = 0; i < 50; i++)
			;
		retryCount--;
	}
	return (FALSE);
}

/******************************************************************************
* Function:		MCI_SendCSD
*
* Purpose:		CMD9, SEND_CSD cmd, it should be sent only at
*					STBY state and after CMD3. See MMC and SD spec. state
*					diagram.
*
* Parameter:
* 			csd : CSD data buffer
*
* Return:		TRUE or FALSE
*
*****************************************************************************/
U32 MCI_SendCSD(U32 *csd) {
	U32 i, retryCount;
	U32 respStatus;
	U32 respValue[4];
	U32 CmdArgument;

	if (MCI_CardType == SD_CARD) {
		CmdArgument = CardRCA;
	} else /* if MMC or unknown card type, use default RCA address. */
	{
		CmdArgument = 0x00010000;
	}

	retryCount = 50;
	while (retryCount > 0) {
		/* Send SET_BLOCK_LEN command before read and write */
		mcidrvdat.regptr->CLEAR |= (MCI_CMDTIMEOUT| MCI_CMDCRCFAIL
		| MCI_CMDRESPEND);
		respStatus = MCI_SendCommand(SEND_CSD, CmdArgument,
									EXPECT_LONG_RESP, 0, (U32 *) &respValue[0]);
		if (!respStatus) {
			for (i = 0; i < 4; i++) {
				csd[i] = respValue[i];
			}
			return (TRUE);
		}
		for (i = 0; i < 50; i++)
		;
		retryCount--;
	}
	return (FALSE);
}

/******************************************************************************
* Function:		MCI_SelectCard
*
* Purpose:		CMD7, SELECT_CARD, should be after CMD9, the state
*						will be inter-changed between STBY and TRANS after
*						this cmd.
*
* Parameter:	None
*
* Return:		return FALSE if response times out.
*
*****************************************************************************/
U32 MCI_SelectCard(void) {
	U32 i, retryCount;
	U32 respStatus;
	U32 respValue[4];
	U32 CmdArgument;

	if (MCI_CardType == SD_CARD) {
		CmdArgument = CardRCA;
	} else /* if MMC or unknown card type, use default RCA addr. */
	{
		CmdArgument = 0x00010000;
	}

	retryCount = 50;
	while (retryCount > 0) {
		/* Send SELECT_CARD command before read and write */
		mcidrvdat.regptr->CLEAR |= (MCI_CMDTIMEOUT| MCI_CMDCRCFAIL
		| MCI_CMDRESPEND);

		respStatus = MCI_SendCommand(SELECT_CARD, CmdArgument,
									EXPECT_SHORT_RESP, 0, (U32 *) &respValue[0]);
		if (!respStatus && ((respValue[0] & (0x0F << 8)) == 0x0700)) {
			/* Should be in STANDBY state now and ready */
			return (TRUE);
		}
		for (i = 0; i < 50; i++)
		;
		retryCount--;
	}
	return (FALSE);
}

/******************************************************************************
* Function:		MCI_SendStatus
*
* Purpose:		CMD13, SEND_STATUS, the most important cmd to
*						debug the state machine of the card.
*
* Parameter:	None
*
* Return:		Response value(card status), true if the ready bit
*					is set in the card status register, if timeout, return
*					INVALID_RESPONSE 0xFFFFFFFF.
*
*****************************************************************************/
U32 MCI_SendStatus(void) {
	U32 retryCount;
	U32 respStatus;
	U32 respValue[4];
	U32 CmdArgument;

	if (MCI_CardType == SD_CARD) {
		CmdArgument = CardRCA;
	} else /* if MMC or unknown card type, use default RCA addr. */
	{
		CmdArgument = 0x00010000;
	}

	/* Note that, since it's called after the block write and read, this timeout
	 is important based on the clock you set for the data communication. */
	retryCount = 2000;
	while (retryCount > 0) {
		/* Send SELECT_CARD command before read and write */
		mcidrvdat.regptr->CLEAR |= (MCI_CMDTIMEOUT| MCI_CMDCRCFAIL
		| MCI_CMDRESPEND);
		respStatus = MCI_SendCommand(SEND_STATUS, CmdArgument,
									EXPECT_SHORT_RESP, 0, (U32 *) &respValue[0]);
		if (!respStatus && (respValue[0] & (1 << 8))) { /* The ready bit should be set, it should be in either TRAN or RCV state now */
			return (respValue[0]);
		}
		retryCount--;
	}
	return (INVALID_RESPONSE);
}

/******************************************************************************
* Function:		MCI_SetBlockLength
*
* Purpose:		CMD16, SET_BLOCKLEN, called after CMD7(SELECT_CARD)
*					called in the TRANS state.
*
* Parameter:
* 			blockLength : The length of the data block to be written or read
*
* Return:		TRUE or FALSE, return TRUE if ready bit is set, and it's
*					in TRANS state.
*
*****************************************************************************/
U32 MCI_SetBlockLength(U32 blockLength) {
	U32 i, retryCount;
	U32 respStatus;
	U32 respValue[4];

	retryCount = 50;
	while (retryCount > 0) {
		/* Send SET_BLOCK_LEN command before read and write */
		mcidrvdat.regptr->CLEAR |= (MCI_CMDTIMEOUT| MCI_CMDCRCFAIL
		| MCI_CMDRESPEND);
		respStatus = MCI_SendCommand(SET_BLOCK_LEN, blockLength,
									EXPECT_SHORT_RESP, 0, (U32 *) &respValue[0]);
		/* bit 9 through 12 should be in transfer state now. bit 8 is ready. */
		if (!respStatus && ((respValue[0] & (0x0F << 8)) == 0x0900)) {
			return (TRUE);
		}
		for (i = 0; i < 50; i++)
		;
		retryCount--;
	}
	return (FALSE);
}

