iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_mci_driver.c
/******************************************************************************
* Function:		MCI_SendACMDBusWidth
*
* Purpose:		ACMD6, SET_BUS_WIDTH, if it's SD card, we can
*					use the 4-bit bus instead of 1-bit. This cmd
*					can only be called during TRANS state.
*					Since it's a ACMD, CMD55 APP_CMD needs to be
*					sent out first.
*
* Parameter:
* 			busWidth : Bus width value, 1-bit is 0, 4-bit is 10
*
* Return:		TRUE or FALSE, TRUE if the card is still in the
*					TRANS state after the cmd.
*
*****************************************************************************/
U32 MCI_SendACMDBusWidth(U32 busWidth) {
	U32 i, retryCount;
	U32 respStatus;
	U32 respValue[4];

	retryCount = 0x20; /* reset retry counter */
	while (retryCount > 0) {
		if (MCI_SendACMD() == FALSE) {
			continue;
		}
		/* Send ACMD6 command to set the bus width */
		respStatus = MCI_SendCommand(SET_ACMD_BUS_WIDTH, busWidth, EXPECT_SHORT_RESP, 0, (U32 *) &respValue[0]);
		if (!respStatus && ((respValue[0] & (0x0F << 8)) == 0x0900)) {
			return (TRUE); /* response is back and correct. */
		}
		for (i = 0; i < 0x20; i++)
			;
		retryCount--;
	}
	return (FALSE);
}

/******************************************************************************
* Function:		MCI_SendStop
*
* Purpose:		CMD12, STOP_TRANSMISSION. if that happens, the card is
*					maybe in a unknown state that need a warm reset.
*
* Parameter:	None
*
* Return:		TRUE or FALSE, TRUE if, at least, the card status
*					shows ready bit is set.
*
*****************************************************************************/
U32 MCI_SendStop(void) {
	U32 i, retryCount;
	U32 respStatus;
	U32 respValue[4];

	retryCount = 50;
	while (retryCount > 0) {
		mcidrvdat.regptr->CLEAR = 0x7FF;
		respStatus = MCI_SendCommand(STOP_TRANSMISSION, 0,
									EXPECT_SHORT_RESP, 0, (U32 *) respValue);
		/* ready bit, bit 8, should be set in the card status register */
		if (!respStatus && (respValue[0] & (1 << 8))) {
			return (TRUE);
		}
		for (i = 0; i < 50; i++)
			;
		retryCount--;
	}
	return (FALSE);
}

/******************************************************************************
* Function:		MCI_SendWriteBlock
*
* Purpose:		CMD24, WRITE_BLOCK, send this cmd in the TRANS state
*					to write a block of data to the card
*
* Parameter:
* 			blockAddress : address of block
* 			numOfBlock : number of block to be written
*
* Return:		TRUE or FALSE
*
*****************************************************************************/
U32 MCI_SendWriteBlock(U32 blockAddress, U32 numOfBlock) {
	U32 i, retryCount;
	U32 respStatus;
	U32 respValue[4];
	U32 commandID;

	if (numOfBlock > 1)
		commandID = WRITE_MULTIPLE_BLOCK;
	else
		commandID = WRITE_BLOCK;

	retryCount = 0x20;
	while (retryCount > 0) {
		mcidrvdat.regptr->CLEAR = 0x7FF;

		respStatus = MCI_SendCommand(commandID, blockAddress * BLOCK_LENGTH, EXPECT_SHORT_RESP, 0, (U32 *) &respValue[0]);
		/* it should be in the transfer state, bit 9~12 is 0x0100 and bit 8 is 1 */
		if (!respStatus && ((respValue[0] & (0x0F << 8)) == 0x0900)) {
			return (TRUE); /* ready and in TRAN state */
		}

		for (i = 0; i < 50; i++)
			;
		retryCount--;
	}
	return (FALSE); /* Fatal error */
}

/******************************************************************************
* Function:		MCI_SendReadBlock
*
* Purpose:		CMD17, READ_SINGLE_BLOCK, send this cmd in the TRANS
*					state to read a block of data from the card.
*
* Parameter:
* 			blockAddress : address of block
* 			numOfBlock :  number of block to be read
*
* Return:		TRUE of FALSE
*
*****************************************************************************/
U32 MCI_SendReadBlock(U32 blockAddress, U32 numOfBlock) {
	U32 i, retryCount;
	U32 respStatus;
	U32 respValue[4];
	U32 commandID;

// To Do: Read Multi-Block
//	if (numOfBlock > 1)
//		commandID = READ_MULTIPLE_BLOCK;
//	else
		commandID = READ_SINGLE_BLOCK;

	retryCount = 0x20;
	while (retryCount > 0) {
		mcidrvdat.regptr->CLEAR = 0x7FF;
		respStatus = MCI_SendCommand(commandID, blockAddress * BLOCK_LENGTH,
									EXPECT_SHORT_RESP, 0, (U32 *) &respValue[0]);
		/* it should be in the transfer state, bit 9~12 is 0x0100 and bit 8 is 1 */
		if (!respStatus && ((respValue[0] & (0x0F << 8)) == 0x0900)) {
			return (TRUE); /* ready and in TRAN state */
		}
		for (i = 0; i < 0x20; i++)
			;
		retryCount--;
	}
	return (FALSE); /* Fatal error */
}
/******************************************************************************
* Function:		MCI_WriteBlock
*
* Purpose:		Set MCI data control register, data length and data
*					timeout, send WRITE_BLOCK cmd, finally, enable
*					interrupt. On completion of WRITE_BLOCK cmd, TX_ACTIVE
*					interrupt will occurs, data can be written continuously
*					into the FIFO until the block data length is reached
*				In Interrupt mode, this function allows write one block
*					at a time
*
* Parameter:
* 			blockAdrress : address of block
* 			dataBuffer :  data buffer
* 			numOfBlock : number of block to be written
*
* Return:		TRUE or FALSE, if cmd times out, return FALSE and no
*					need to continue.
*
*****************************************************************************/
U32 MCI_WriteBlock(U32 blockAdrress, S8* dataBuffer, U32 numOfBlock) {
	__IO U32 i;
	__IO U32 j;
	U32 DataCtrl = 0;

	mcidrvdat.regptr->CLEAR = 0x7FF;
	mcidrvdat.regptr->DATACTRL = 0;
	for (i = 0; i < 20; i++)
		;

	/* Below status check is redundant, but ensure card is in TRANS state
	 before writing and reading to from the card length. */
	if (MCI_CheckStatus() != TRUE) {
		MCI_SendStop();
		return (FALSE);
	}

	mcidrvdat.regptr->DATATIMER = DATA_TIMER_VALUE;
	mcidrvdat.regptr->DATALENGTH = BLOCK_LENGTH;
	MCI_Block_End_Flag = 1;
	MCI_TXEnable();
	if (MCI_SendWriteBlock(blockAdrress, numOfBlock) == FALSE) {
		return (FALSE);
	}
#if MCI_DMA_ENABLED
	for (j = 0; j < numOfBlock; j++, dataBuffer = dataBuffer + BLOCK_LENGTH) {
		memcpy(WriteBlock, dataBuffer, DMA_SIZE);

		GPDMA_Config(0, GPDMA_M2P_P, DMA_SIZE, GPDMA_BSIZE_32, GPDMA_BSIZE_8, GPDMA_WIDTH_WORD,
						GPDMA_WIDTH_WORD, MCI_DMA_SRC, (U32) &MCI_FIFO, 0, GPDMA_PSRC_SDMMC);

		/* Write, block transfer, DMA, and data length */
		DataCtrl |= (MCI_DATACTRL_ENABLE| MCI_DATACTRL_DMAENABLE
		| MCI_DTATCTRL_BLOCKSIZE(DATA_BLOCK_LEN));
		mcidrvdat.regptr->DATACTRL = DataCtrl;

		for (i = 0; i < 10000; i++) {
			if (GPDMA->RAWINTTCSTATUS & 0x01) {
				/* Data transfer finished */
				break;
			}
		}
		if (i == 0) {
			MCI_SendStop();
			return FALSE;
			break;
		}
		if (numOfBlock == 1) {
			return TRUE;
		}
		for (i = 0; i < 10; i++)
		;
	}
	MCI_SendStop();
#else
	mcidrvdat.WriteDataBuffer = dataBuffer;
	/* Write, block transfer, and data length */
	DataCtrl |= (MCI_DATACTRL_ENABLE | MCI_DTATCTRL_BLOCKSIZE(DATA_BLOCK_LEN));
	mcidrvdat.regptr->DATACTRL = DataCtrl;
#endif

