iarsystems/ewarm-nxp-example-projects/LPC_CDL/LPC_CDL/software/csps/lpc23xx/source/lpc23xx_mci_driver.c
	return (TRUE);
}

/******************************************************************************
* Function:		MCI_ReadBlock
*
* Purpose:		Set MCI data control register, data length and data
*					timeout, send READ_SINGLE_BLOCK cmd, finally, enable
*					interrupt. On completion of READ_SINGLE_BLOCK cmd,
*					RX_ACTIVE interrupt will occurs, data can be read
*					continuously into the FIFO until the block data
*					length is reached.
*				This Function only allows read one block at a time
*
* Parameter:
* 			blockAdrress : address of block
* 			dataBuffer :  data buffer
* 			numOfBlock : number of block to be read
*
* Return:		TRUE or FALSE, if cmd times out, return FALSE and no
*					need to continue.
*
*****************************************************************************/
U32 MCI_ReadBlock(U32 blockAdrress, S8* dataBuffer, U32 numOfBlock) {
	__IO U32 i;
	U32 DataCtrl = 0;

	if (numOfBlock > 1)
		return FALSE;
	// To Do: Read Multi-Block

	mcidrvdat.regptr->CLEAR = 0x7FF;
	mcidrvdat.regptr->DATACTRL = 0;
	for (i = 0; i < 0x10; i++)
		;

	/* Below status check is redundant, but ensure card is in TRANS state
	 before writing and reading to from the card. */
	if (MCI_CheckStatus() != TRUE) {
		MCI_SendStop();
		return (FALSE);
	}
	MCI_RXEnable();

	mcidrvdat.regptr->DATATIMER = DATA_TIMER_VALUE;
	mcidrvdat.regptr->DATALENGTH = BLOCK_LENGTH;
	MCI_Block_End_Flag = 1;
	if (MCI_SendReadBlock(blockAdrress, numOfBlock) == FALSE) {
		return (FALSE);
	}

#if MCI_DMA_ENABLED
	GPDMA_Config(1, GPDMA_P2M_P, DMA_SIZE, GPDMA_BSIZE_8, GPDMA_BSIZE_32, GPDMA_WIDTH_WORD,
					GPDMA_WIDTH_WORD, (U32) &MCI_FIFO, MCI_DMA_DST, GPDMA_PSRC_SDMMC, 0);

	/* Write, block transfer, DMA, and data length */
	DataCtrl |= (MCI_DATACTRL_ENABLE| MCI_DATACTRL_DIRECTION
				| MCI_DATACTRL_DMAENABLE | MCI_DTATCTRL_BLOCKSIZE(DATA_BLOCK_LEN));
	mcidrvdat.regptr->DATACTRL = DataCtrl;

	for (i = 0; i < 10000; i++) {
		if (GPDMA->RAWINTTCSTATUS & 0x02) {
			/* Data transfer finished */
			break;
		}
	}
	if (i == 0 && i == 10000) {
		return FALSE;
	} else memcpy(dataBuffer, ReadBlock, DMA_SIZE);

#else
	mcidrvdat.ReadDataBuffer = dataBuffer;
	/* Read, enable, block transfer, and data length */
	DataCtrl |= (MCI_DATACTRL_ENABLE | MCI_DATACTRL_DIRECTION
			| MCI_DTATCTRL_BLOCKSIZE(DATA_BLOCK_LEN));
	mcidrvdat.regptr->DATACTRL = DataCtrl;
#endif

	for (i = 0; i < 0x10; i++);

	return (TRUE);
}

/******************************************************************************
* Function:		MCI_SDStatus (This function is used by ChaN FAT)
*
* Purpose:		reads the 512bit SD_STATUS (3-22) using ACMD13 (4-37)
*					Card must be in trans-state for this (4-7)
*					( SD-Status in ReadBlock when MCI_Block_End_Flag==1 )
*
* Parameter:	None
*
* Return:		TRUE or FALSE
*
*****************************************************************************/
U32 MCI_SDStatus(void) {
	__IO U32 i;
	U32 retryCount;
	U32 respStatus;
	U32 respValue[4];
	U32 DataCtrl = 0;

	if ((MCI_CardType == CARD_UNKNOWN) || (MCI_CardType == MMC_CARD)) {
		return (FALSE); // unsupported
	}

	mcidrvdat.regptr->CLEAR = 0x7FF;
	mcidrvdat.regptr->DATACTRL = 0;
	for (i = 0; i < 0x10; i++) {
		;
	}

	/* Below status check is redundant, but ensure card is in TRANS state
	 before writing and reading to from the card. */
	if (MCI_CheckStatus() != TRUE) {
		MCI_SendStop();
		return (FALSE);
	}

	MCI_RXEnable();

	mcidrvdat.regptr->DATATIMER = DATA_TIMER_VALUE;
	mcidrvdat.regptr->DATALENGTH = BLOCK_LENGTH;

	MCI_Block_End_Flag = 1;
	SDStatRead = 1;

	retryCount = 0x20;
	while (retryCount > 0) {
		mcidrvdat.regptr->CLEAR = 0x7FF;
		// prepare for ACMD (with CMD55)
		if (MCI_SendACMD() == TRUE) {
			// Send ACMD13
			respStatus = MCI_SendCommand(SEND_STATUS, 0,
					EXPECT_SHORT_RESP, 0, (U32 *) &respValue[0]);
			/* it should be in the transfer state, bit 9~12 is 0x0100 and bit 8 is 1 */
			if (!respStatus && ((respValue[0] & (0x0F << 8)) == 0x0900)) {
				break; /* ready and in TRAN state */
			}
		}
		for (i = 0; i < 0x20; i++) {
			;
		}
		retryCount--;
	}
	if (retryCount == 0) {
		return (FALSE); // error sending ACMD13 or state not trans
	}

#if MCI_DMA_ENABLED
	GPDMA_Config(1, GPDMA_P2M_P, DMA_SIZE, GPDMA_BSIZE_8, GPDMA_BSIZE_32, GPDMA_WIDTH_WORD,
					GPDMA_WIDTH_WORD, (U32) &MCI_FIFO, MCI_DMA_DST, GPDMA_PSRC_SDMMC, 0);

	/* Write, block transfer, DMA, and data length */
	DataCtrl |= (MCI_DATACTRL_ENABLE| MCI_DATACTRL_DIRECTION
				| MCI_DATACTRL_DMAENABLE | MCI_DTATCTRL_BLOCKSIZE(DATA_BLOCK_LEN));
	mcidrvdat.regptr->DATACTRL = DataCtrl;

#else
	/* Read, enable, block transfer, and data length */
	DataCtrl |= (MCI_DATACTRL_ENABLE | MCI_DATACTRL_DIRECTION
			| MCI_DTATCTRL_BLOCKSIZE(DATA_BLOCK_LEN));
	mcidrvdat.regptr->DATACTRL = DataCtrl;
#endif

	// mci_debug_printf("MCI_SD_Status: DATA_CTRL set\n");
	for (i = 0; i < 0x10; i++) {
		;
	}

	return (TRUE);
}

/******************************************************************************
* Function:			MCI_PowerOff
*
* Descriptions:		disable power to MCI (Power-Reg)
*
* Parameter:		None
*
* Return:			None
*
*****************************************************************************/
void MCI_PowerOff(void) {
	__IO U32 i;

	mcidrvdat.regptr->POWER = 0;
	for (i = 0; i < 0x100; i++)
		;
	return;
}
